App/househelp-api/scripts/perf/results-20260503-173623/insights.txt
Running 30s test @ http://localhost:8080/api/v1/insights/nearby?lat=28.6&lng=77.2
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    68.65ms   41.73ms 507.95ms   92.60%
    Req/Sec   517.03    160.64     1.59k    76.97%
  Latency Distribution
     50%   56.89ms
     75%   67.94ms
     90%   92.62ms
     99%  284.12ms
  184171 requests in 30.10s, 151.70MB read
  Non-2xx or 3xx responses: 184171
Requests/sec:   6119.40
Transfer/sec:      5.04MB